tylertms/dspic33e-sim/conformance/qei.c
#include <inttypes.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>

#include "device.h"
#include "dspic33.h"
#include "sfr_side_effect_coverage.h"

static const SfrSideEffectCoverage qei_sfr_side_effect_coverage[] = {
    {0x01c4u, 0x2aaau},
    {0x01ccu, 0xffffu},
    {0x05c4u, 0x2aaau},
    {0x05ccu, 0xffffu},
};

typedef struct {
    uint32_t cases;
    uint32_t passed;
    uint32_t failed;
} QeiConformance;

enum {
    QEI_ENABLE = 0x8000u,
    QEI_STOP_IDLE = 0x2000u,
    QEI_POSITION_MODE_SHIFT = 10u,
    QEI_INDEX_MATCH_SHIFT = 8u,
    QEI_DIVIDER_SHIFT = 4u,
    QEI_GATE_ENABLE = 0x0004u,
    QEI_MODE_QUADRATURE = 0u,
    QEI_MODE_UP_DOWN = 1u,
    QEI_MODE_GATE = 2u,
    QEI_MODE_TIMER = 3u,
    QEI_CAPTURE_HOME = 0x8000u,
    QEI_FILTER_ENABLE = 0x4000u,
    QEI_OUTPUT_GREATER_EQUAL = 0x0200u,
    QEI_OUTPUT_LESS_EQUAL = 0x0400u,
    QEI_OUTPUT_OUTSIDE = 0x0600u,
    QEI_SWAP = 0x0100u,
    QEI_PHASE_A_POLARITY = 0x0010u,
    QEI_STATUS_INDEX_ENABLE = 0x0001u,
    QEI_STATUS_INDEX = 0x0002u,
    QEI_STATUS_HOME_ENABLE = 0x0004u,
    QEI_STATUS_HOME = 0x0008u,
    QEI_STATUS_VELOCITY_OVERFLOW_ENABLE = 0x0010u,
    QEI_STATUS_VELOCITY_OVERFLOW = 0x0020u,
    QEI_STATUS_INITIALIZED_ENABLE = 0x0040u,
    QEI_STATUS_INITIALIZED = 0x0080u,
    QEI_STATUS_POSITION_OVERFLOW_ENABLE = 0x0100u,
    QEI_STATUS_POSITION_OVERFLOW = 0x0200u,
    QEI_STATUS_LOW_COMPARE_ENABLE = 0x0400u,
    QEI_STATUS_LOW_COMPARE = 0x0800u,
    QEI_STATUS_HIGH_COMPARE_ENABLE = 0x1000u,
    QEI_STATUS_HIGH_COMPARE = 0x2000u,
    CAPTURE_BASE = 0x0140u,
    CAPTURE_FP_EVERY_EDGE = 0x1c01u,
    CAPTURE_FP_RISING = 0x1c03u,
    QEI_VECTOR = 0x0240u
};

static const uint16_t bases[DSPIC33_QEI_COUNT] = {0x01c0u, 0x05c0u};
static const uint16_t pmd_addresses[DSPIC33_QEI_COUNT] = {0x0760u, 0x0764u};
static const uint16_t pmd_masks[DSPIC33_QEI_COUNT] = {0x0400u, 0x0020u};
static const uint16_t interrupt_addresses[DSPIC33_QEI_COUNT] = {0x0806u, 0x0808u};
static const uint16_t interrupt_masks[DSPIC33_QEI_COUNT] = {0x0400u, 0x0800u};
static const uint16_t pps_input_registers[DSPIC33_QEI_COUNT][2] = {{0x06bcu, 0x06beu},
                                                                   {0x06c0u, 0x06c2u}};

static void expect(QeiConformance* state, bool condition, const char* name) {
    state->cases++;
    if (condition) {
        state->passed++;
    } else {
        state->failed++;
        printf("[qei-failed] %s\n", name);
    }
}

static uint32_t read_counter(Dspic33* cpu, uint16_t low) {
    uint32_t value = dspic33_read_word(cpu, low);
    return value | ((uint32_t)dspic33_read_word(cpu, (uint16_t)(low + 2u)) << 16u);
}

static void write_counter(Dspic33* cpu, uint16_t low, uint16_t hold, uint32_t value) {
    dspic33_write_word(cpu, hold, (uint16_t)(value >> 16u));
    dspic33_write_word(cpu, low, (uint16_t)value);
}

static bool input(Dspic33* cpu, uint8_t channel, Dspic33QeiInput source, bool high) {
    return dspic33_qei_input(cpu, channel, source, high, 0u) &&
           dspic33_device_advance(cpu, 0u);
}

static void reset_qei(Dspic33* cpu) {
    uint8_t channel;
    uint8_t source;
    for (channel = 0u; channel < DSPIC33_QEI_COUNT; channel++) {
        for (source = 0u; source < 4u; source++) {
            dspic33_qei_input(cpu, channel, (Dspic33QeiInput)source, false, 0u);
        }
    }
    dspic33_device_advance(cpu, 0u);
    dspic33_reset(cpu, 0u);
}

static void clear_interrupt(Dspic33* cpu, uint8_t channel) {
    dspic33_write_word(cpu, interrupt_addresses[channel],
                       (uint16_t)(dspic33_read_word(cpu, interrupt_addresses[channel]) &
                                  ~interrupt_masks[channel]));
}

static void select_pps_input(Dspic33* cpu, uint8_t channel, uint8_t input,
                             uint8_t pin) {
    uint16_t address = pps_input_registers[channel][input / 2u];
    if ((input & 1u) == 0u) {
        dspic33_write_byte(cpu, address, pin);
    } else {
        dspic33_write_byte(cpu, (uint16_t)(address + 1u), pin);
    }
}

static bool interrupt_set(Dspic33* cpu, uint8_t channel) {
    return (dspic33_read_word(cpu, interrupt_addresses[channel]) &
            interrupt_masks[channel]) != 0u;
}

static void configure_interrupt(Dspic33* cpu, uint8_t channel) {
    uint8_t irq = channel == 0u ? 58u : 75u;
    uint16_t enable = (uint16_t)(0x0820u + (irq / 16u) * 2u);
    uint16_t priority = (uint16_t)(0x0840u + (irq / 4u) * 2u);
    uint16_t shift = (uint16_t)((irq % 4u) * 4u);
    dspic33_write_word(
        cpu, enable,
        (uint16_t)(dspic33_read_word(cpu, enable) | (uint16_t)(1u << (irq % 16u))));
    dspic33_write_word(
        cpu, priority,
        (uint16_t)((dspic33_read_word(cpu, priority) & ~(uint16_t)(7u << shift)) |
                   (uint16_t)(3u << shift)));
    cpu->program[(0x0014u + irq * 2u) / 2u] = QEI_VECTOR;
    cpu->w[15] = 0x1800u;
}

static void set_open_comparison_window(Dspic33* cpu, uint16_t base) {
    dspic33_write_word(cpu, (uint16_t)(base + 0x1eu), 0x7fffu);
    dspic33_write_word(cpu, (uint16_t)(base + 0x1cu), 0xffffu);
    dspic33_write_word(cpu, (uint16_t)(base + 0x22u), 0x8000u);
    dspic33_write_word(cpu, (uint16_t)(base + 0x20u), 0x0000u);
}

static void register_cases(QeiConformance* state, Dspic33* cpu) {
    static const uint16_t offsets[18] = {0x00u, 0x02u, 0x04u, 0x06u, 0x08u, 0x0au,
                                         0x0cu, 0x0eu, 0x10u, 0x12u, 0x14u, 0x16u,
                                         0x18u, 0x1au, 0x1cu, 0x1eu, 0x20u, 0x22u};
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_QEI_COUNT; channel++) {
        uint16_t base = bases[channel];
        uint8_t index;
        reset_qei(cpu);
        for (index = 0u; index < 18u; index++) {
            expect(state,
                   dspic33_read_word(cpu, (uint16_t)(base + offsets[index])) == 0u,
                   "QEI register reset");
        }
        dspic33_write_word(cpu, base, UINT16_MAX);
        expect(state, dspic33_read_word(cpu, base) == 0xbf7fu,
               "QEI control access mask");
        dspic33_write_word(cpu, base, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 2u), UINT16_MAX);
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 2u)) == 0xffffu,
               "QEI IO control keeps live inputs read only");
        dspic33_write_word(cpu, (uint16_t)(base + 4u), 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 4u), UINT16_MAX);
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 4u)) == 0x1555u,
               "QEI status flags cannot be software set");
        dspic33_write_word(cpu, (uint16_t)(base + 6u), 0x5678u);
        dspic33_write_word(cpu, (uint16_t)(base + 8u), 0x1234u);
        expect(state, read_counter(cpu, (uint16_t)(base + 6u)) == 0x12345678u,
               "QEI direct position words read coherently");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 0x0au)) == 0x1234u,
               "QEI position low read captures high hold");
        write_counter(cpu, (uint16_t)(base + 6u), (uint16_t)(base + 0x0au),
                      0xa1b2c3d4u);
        expect(state, read_counter(cpu, (uint16_t)(base + 6u)) == 0xa1b2c3d4u,
               "QEI position hold write commits with low word");
        write_counter(cpu, (uint16_t)(base + 0x16u), (uint16_t)(base + 0x1au),
                      0x10203040u);
        expect(state,
               read_counter(cpu, (uint16_t)(base + 0x16u)) == 0x10203040u &&
                   dspic33_read_word(cpu, (uint16_t)(base + 0x1au)) == 0x1020u,
               "QEI index hold transfers both directions");
        dspic33_write_word(cpu, (uint16_t)(base + 0x0cu), 0x55aau);
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 0x0cu)) == 0x55aau,
               "QEI velocity read returns pre-clear value");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 0x0cu)) == 0u,
               "QEI velocity read clears counter");
        dspic33_write_word(cpu, (uint16_t)(base + 0x1cu), 0x2468u);
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 0x1cu)) == 0x2468u,
               "QEI GEC and IC alias storage is writable");
    }
}

static void quadrature_cases(QeiConformance* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_QEI_COUNT; channel++) {
        uint16_t base = bases[channel];
        reset_qei(cpu);
        set_open_comparison_window(cpu, base);
        dspic33_write_word(cpu, base, QEI_ENABLE | QEI_MODE_QUADRATURE);
        expect(state, input(cpu, channel, DSPIC33_QEI_PHASE_A, true),
               "schedule QEI quadrature phase A rise");
        expect(state,
               input(cpu, channel, DSPIC33_QEI_PHASE_B, true) &&
                   input(cpu, channel, DSPIC33_QEI_PHASE_A, false) &&
                   input(cpu, channel, DSPIC33_QEI_PHASE_B, false),
               "complete QEI positive quadrature cycle");
        expect(state, read_counter(cpu, (uint16_t)(base + 6u)) == 4u,
               "QEI x4 quadrature positive count");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 0x0cu)) == 4u,
               "QEI velocity follows quadrature count");
        expect(state,
               input(cpu, channel, DSPIC33_QEI_INDEX, true) &&
                   (read_counter(cpu, (uint16_t)(base + 0x16u)) == 1u ||
                    read_counter(cpu, (uint16_t)(base + 0x16u)) == UINT32_MAX),
               "B1 quadrature Index counter stays within its direction ambiguity");
        input(cpu, channel, DSPIC33_QEI_INDEX, false);
        expect(state,
               input(cpu, channel, DSPIC33_QEI_PHASE_B, true) &&
                   input(cpu, channel, DSPIC33_QEI_PHASE_A, true) &&
                   input(cpu, channel, DSPIC33_QEI_PHASE_B, false) &&
                   input(cpu, channel, DSPIC33_QEI_PHASE_A, false),
               "complete QEI negative quadrature cycle");
        expect(state, read_counter(cpu, (uint16_t)(base + 6u)) == 0u,
               "QEI x4 quadrature negative count");

        reset_qei(cpu);
        set_open_comparison_window(cpu, base);
        dspic33_write_word(cpu, (uint16_t)(base + 2u), QEI_SWAP);
        dspic33_write_word(cpu, base, QEI_ENABLE);
        expect(state, input(cpu, channel, DSPIC33_QEI_PHASE_A, true),
               "schedule swapped QEI input");
        expect(state, read_counter(cpu, (uint16_t)(base + 6u)) == UINT32_MAX,
               "QEI input swap reverses first phase direction");
        dspic33_write_word(cpu, (uint16_t)(base + 2u), QEI_PHASE_A_POLARITY);
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 2u)) & 1u) == 0u,
               "QEI polarity controls live phase status");
    }
}

static void quadrature_transition_cases(QeiConformance* state, Dspic33* cpu) {
    static const int8_t actions[16] = {0, 1, -1, 0,  -1, 0,  0, 1,
                                       1, 0, 0,  -1, 0,  -1, 1, 0};
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_QEI_COUNT; channel++) {
        uint16_t base = bases[channel];
        uint8_t previous;
        for (previous = 0u; previous < 4u; previous++) {
            uint8_t current;
            for (current = 0u; current < 4u; current++) {
                int8_t action = actions[(previous << 2u) | current];
                uint32_t expected = (uint32_t)(0x100 + action);
                reset_qei(cpu);
                set_open_comparison_window(cpu, base);
                dspic33_write_word(cpu, (uint16_t)(base + 2u), QEI_FILTER_ENABLE);
                input(cpu, channel, DSPIC33_QEI_PHASE_A, (previous & 1u) != 0u);
                input(cpu, channel, DSPIC33_QEI_PHASE_B, (previous & 2u) != 0u);
                dspic33_device_advance(cpu, 3u);
                write_counter(cpu, (uint16_t)(base + 6u), (uint16_t)(base + 0x0au),
                              0x100u);
                dspic33_write_word(cpu, base, QEI_ENABLE);
                input(cpu, channel, DSPIC33_QEI_PHASE_A, (current & 1u) != 0u);
                input(cpu, channel, DSPIC33_QEI_PHASE_B, (current & 2u) != 0u);
                expect(state,
                       dspic33_device_advance(cpu, 3u) &&
                           read_counter(cpu, (uint16_t)(base + 6u)) == expected &&
                           dspic33_read_word(cpu, (uint16_t)(base + 0x0cu)) ==
                               (uint16_t)action,
                       "QEI quadrature truth table transition");
            }
        }
    }
}

static void divider_polarity_output_cases(QeiConformance* state, Dspic33* cpu) {
    static const uint16_t counter_divisors[8] = {1u, 2u, 4u, 8u, 16u, 32u, 64u, 128u};
    static const uint16_t filter_divisors[8] = {1u, 2u, 4u, 8u, 16u, 32u, 64u, 256u};
    static const int32_t positions[3] = {1, 3, 6};
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_QEI_COUNT; channel++) {
        uint16_t base = bases[channel];
        uint8_t selection;
        for (selection = 0u; selection < 8u; selection++) {
            uint16_t divisor = counter_divisors[selection];
            reset_qei(cpu);
            set_open_comparison_window(cpu, base);
            dspic33_write_word(cpu, base,
                               (uint16_t)(QEI_ENABLE |
                                          ((uint16_t)selection << QEI_DIVIDER_SHIFT) |
                                          QEI_MODE_TIMER));
            expect(state,
                   dspic33_device_advance(cpu, (uint16_t)(divisor - 1u)) &&
                       read_counter(cpu, (uint16_t)(base + 6u)) == 0u,
                   "QEI counter divider waits for its complete period");
            expect(state,
                   dspic33_device_advance(cpu, 1u) &&
                       read_counter(cpu, (uint16_t)(base + 6u)) == 1u,
                   "QEI counter divider clocks at the selected period");

            divisor = filter_divisors[selection];
            reset_qei(cpu);
            set_open_comparison_window(cpu, base);
            dspic33_write_word(
                cpu, (uint16_t)(base + 2u),
                (uint16_t)(QEI_FILTER_ENABLE | ((uint16_t)selection << 11u)));
            dspic33_write_word(cpu, base, QEI_ENABLE);
            input(cpu, channel, DSPIC33_QEI_PHASE_A, true);
            expect(state,
                   dspic33_device_advance(cpu, (uint16_t)(3u * divisor - 1u)) &&
                       read_counter(cpu, (uint16_t)(base + 6u)) == 0u,
                   "QEI filter divider waits for three complete samples");
            expect(state,
                   dspic33_device_advance(cpu, 1u) &&
                       read_counter(cpu, (uint16_t)(base + 6u)) == 1u,
                   "QEI filter divider accepts the third stable sample");
        }

        for (selection = 0u; selection < 4u; selection++) {
            uint16_t polarity = (uint16_t)(1u << (4u + selection));
            reset_qei(cpu);
            dspic33_write_word(cpu, (uint16_t)(base + 2u), polarity);
            expect(state,
                   (dspic33_read_word(cpu, (uint16_t)(base + 2u)) & 0x000fu) ==
                       (uint16_t)(1u << selection),
                   "QEI input polarity inverts a low physical input");
            expect(state,
                   input(cpu, channel, (Dspic33QeiInput)selection, true) &&
                       (dspic33_read_word(cpu, (uint16_t)(base + 2u)) & 0x000fu) == 0u,
                   "QEI input polarity inverts a high physical input");
        }

        for (selection = 0u; selection < 4u; selection++) {
            uint8_t position_index;
            for (position_index = 0u; position_index < 3u; position_index++) {
                bool high;
                bool expected = (selection == 1u && positions[position_index] >= 5) ||
                                (selection == 2u && positions[position_index] <= 2) ||
                                (selection == 3u && (positions[position_index] >= 5 ||
                                                     positions[position_index] <= 2));
                reset_qei(cpu);
                write_counter(cpu, (uint16_t)(base + 0x1cu), (uint16_t)(base + 0x1eu),
                              5u);
                write_counter(cpu, (uint16_t)(base + 0x20u), (uint16_t)(base + 0x22u),
                              2u);
                write_counter(cpu, (uint16_t)(base + 6u), (uint16_t)(base + 0x0au),
                              (uint32_t)positions[position_index]);
                dspic33_write_word(cpu, (uint16_t)(base + 2u),
                                   (uint16_t)(selection << 9u));
                expect(state,
                       dspic33_qei_compare_output(cpu, channel, &high) &&
                           high == expected,
                       "QEI compare output mode follows both signed boundaries");
            }
        }
    }
}

static void external_mode_cases(QeiConformance* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_QEI_COUNT; channel++) {
        uint16_t base = bases[channel];
        reset_qei(cpu);
        set_open_comparison_window(cpu, base);
        dspic33_write_word(cpu, base, QEI_ENABLE | QEI_MODE_UP_DOWN);
        expect(state,
               input(cpu, channel, DSPIC33_QEI_PHASE_B, true) &&
                   input(cpu, channel, DSPIC33_QEI_PHASE_A, true),
               "QEI external up direction inputs");
        expect(state, read_counter(cpu, (uint16_t)(base + 6u)) == 1u,
               "QEI external up direction increments");
        expect(state,
               input(cpu, channel, DSPIC33_QEI_PHASE_A, false) &&
                   input(cpu, channel, DSPIC33_QEI_PHASE_B, false) &&
                   input(cpu, channel, DSPIC33_QEI_PHASE_A, true),
               "QEI external down direction inputs");
        expect(state, read_counter(cpu, (uint16_t)(base + 6u)) == 0u,
               "QEI external down direction decrements");

        reset_qei(cpu);
        set_open_comparison_window(cpu, base);
        dspic33_write_word(cpu, base, QEI_ENABLE | QEI_GATE_ENABLE | QEI_MODE_GATE);
        expect(state, input(cpu, channel, DSPIC33_QEI_PHASE_A, true),
               "QEI gated external clock while gate low");
        expect(state, read_counter(cpu, (uint16_t)(base + 6u)) == 0u,
               "QEI low gate inhibits external clock");
        expect(state,
               input(cpu, channel, DSPIC33_QEI_PHASE_A, false) &&
                   input(cpu, channel, DSPIC33_QEI_PHASE_B, true) &&
                   input(cpu, channel, DSPIC33_QEI_PHASE_A, true),
               "QEI gated external clock while gate high");
        expect(state,
               read_counter(cpu, (uint16_t)(base + 6u)) == 1u &&
                   read_counter(cpu, (uint16_t)(base + 0x16u)) == 0u &&
                   read_counter(cpu, (uint16_t)(base + 0x0eu)) == 0u &&
                   dspic33_read_word(cpu, (uint16_t)(base + 0x0cu)) == 1u,
               "QEI external mode applies independent timer gates");
        expect(state,
               dspic33_device_advance(cpu, 5u) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 1u &&
                   read_counter(cpu, (uint16_t)(base + 0x0eu)) == 0u,
               "QEI external gate mode does not also clock from FCY");

        expect(state,
               input(cpu, channel, DSPIC33_QEI_PHASE_A, false) &&
                   input(cpu, channel, DSPIC33_QEI_INDEX, true) &&
                   input(cpu, channel, DSPIC33_QEI_HOME, true) &&
                   input(cpu, channel, DSPIC33_QEI_PHASE_A, true) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 2u &&
                   read_counter(cpu, (uint16_t)(base + 0x16u)) == 1u &&
                   read_counter(cpu, (uint16_t)(base + 0x0eu)) == 1u &&
                   dspic33_read_word(cpu, (uint16_t)(base + 0x0cu)) == 1u,
               "QEI external clock drives each enabled timer gate");

        reset_qei(cpu);
        set_open_comparison_window(cpu, base);
        dspic33_write_word(cpu, base, QEI_ENABLE | QEI_MODE_GATE);
        expect(state,
               input(cpu, channel, DSPIC33_QEI_PHASE_A, true) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 1u &&
                   read_counter(cpu, (uint16_t)(base + 0x16u)) == 0u &&
                   read_counter(cpu, (uint16_t)(base + 0x0eu)) == 0u &&
                   dspic33_read_word(cpu, (uint16_t)(base + 0x0cu)) == 1u,
               "QEI external ungated mode clocks position and velocity together");

        reset_qei(cpu);
        set_open_comparison_window(cpu, base);
        expect(state,
               input(cpu, channel, DSPIC33_QEI_PHASE_B, true) &&
                   input(cpu, channel, DSPIC33_QEI_INDEX, true) &&
                   input(cpu, channel, DSPIC33_QEI_HOME, true),
               "apply QEI external timer gate inputs");
        dspic33_write_word(cpu, base, QEI_ENABLE | 0x0008u | QEI_MODE_GATE);
        expect(state,
               input(cpu, channel, DSPIC33_QEI_PHASE_A, true) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == UINT32_MAX &&
                   read_counter(cpu, (uint16_t)(base + 0x16u)) == UINT32_MAX &&
                   read_counter(cpu, (uint16_t)(base + 0x0eu)) == 1u &&
                   dspic33_read_word(cpu, (uint16_t)(base + 0x0cu)) == UINT16_MAX,
               "QEI external timer direction excludes only the interval timer");
    }
}

