tylertms/dspic33e-sim/conformance/qei.c
static void pmd_cases(QeiConformance* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_QEI_COUNT; channel++) {
        uint16_t base = bases[channel];
        reset_qei(cpu);
        set_open_comparison_window(cpu, base);
        dspic33_write_word(cpu, base, QEI_ENABLE | QEI_MODE_TIMER);
        expect(state,
               dspic33_device_advance(cpu, 3u) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 3u,
               "QEI advances before PMD");
        dspic33_write_word(cpu, pmd_addresses[channel], pmd_masks[channel]);
        expect(state,
               !cpu->io.qei.pmd_disabled[channel] &&
                   dspic33_read_word(cpu, base) == (QEI_ENABLE | QEI_MODE_TIMER),
               "QEI PMD set is delayed one cycle");
        expect(state,
               dspic33_device_advance(cpu, 1u) && cpu->io.qei.pmd_disabled[channel] &&
                   dspic33_read_word(cpu, base) == 0u,
               "QEI PMD disables after one enabled cycle");
        dspic33_write_word(cpu, base, 0u);
        expect(state,
               dspic33_device_advance(cpu, 5u) && dspic33_read_word(cpu, base) == 0u,
               "QEI PMD blocks register writes and counter progress");
        dspic33_write_word(cpu, pmd_addresses[channel], 0u);
        expect(state,
               dspic33_device_advance(cpu, 1u) && !cpu->io.qei.pmd_disabled[channel] &&
                   dspic33_read_word(cpu, base) == (QEI_ENABLE | QEI_MODE_TIMER),
               "QEI PMD clear enables after one disabled cycle");
        expect(state,
               read_counter(cpu, (uint16_t)(base + 6u)) == 4u &&
                   dspic33_device_advance(cpu, 2u) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 6u,
               "QEI PMD preserves and resumes counter state");

        reset_qei(cpu);
        set_open_comparison_window(cpu, base);
        dspic33_write_word(cpu, base,
                           QEI_ENABLE | (2u << QEI_DIVIDER_SHIFT) | QEI_MODE_TIMER);
        expect(state,
               dspic33_device_advance(cpu, 2u) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 0u,
               "QEI accumulates partial prescaler phase before PMD");
        dspic33_write_word(cpu, pmd_addresses[channel], pmd_masks[channel]);
        expect(state,
               dspic33_device_advance(cpu, 1u) && cpu->io.qei.pmd_disabled[channel],
               "QEI PMD transition preserves partial prescaler phase");
        expect(state,
               dspic33_device_advance(cpu, 7u) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 0u,
               "QEI PMD freezes partial prescaler phase");
        dspic33_write_word(cpu, pmd_addresses[channel], 0u);
        expect(state,
               dspic33_device_advance(cpu, 1u) && !cpu->io.qei.pmd_disabled[channel] &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 0u,
               "QEI PMD clear does not consume prescaler phase");
        expect(state,
               dspic33_device_advance(cpu, 1u) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 1u,
               "QEI resumes after the exact remaining prescaler phase");

        reset_qei(cpu);
        set_open_comparison_window(cpu, base);
        dspic33_write_word(cpu, (uint16_t)(base + 4u), QEI_STATUS_INDEX_ENABLE);
        dspic33_write_word(cpu, base, QEI_ENABLE);
        expect(state,
               input(cpu, channel, DSPIC33_QEI_INDEX, true) &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 4u)) & QEI_STATUS_INDEX) !=
                       0u,
               "QEI Index match latches before PMD");
        dspic33_write_word(cpu, (uint16_t)(base + 4u),
                           (uint16_t)(dspic33_read_word(cpu, (uint16_t)(base + 4u)) &
                                      ~QEI_STATUS_INDEX));
        clear_interrupt(cpu, channel);
        dspic33_write_word(cpu, pmd_addresses[channel], pmd_masks[channel]);
        expect(state,
               dspic33_device_advance(cpu, 1u) &&
                   input(cpu, channel, DSPIC33_QEI_INDEX, false),
               "QEI PMD Index deassertion updates the external level");
        dspic33_write_word(cpu, pmd_addresses[channel], 0u);
        expect(state,
               dspic33_device_advance(cpu, 1u) &&
                   input(cpu, channel, DSPIC33_QEI_INDEX, true) &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 4u)) & QEI_STATUS_INDEX) !=
                       0u &&
                   interrupt_set(cpu, channel),
               "QEI PMD Index deassertion rearms after resume");

        reset_qei(cpu);
        set_open_comparison_window(cpu, base);
        dspic33_write_word(cpu, base, QEI_ENABLE);
        dspic33_write_word(cpu, pmd_addresses[channel], pmd_masks[channel]);
        expect(state,
               dspic33_device_advance(cpu, 1u) &&
                   input(cpu, channel, DSPIC33_QEI_PHASE_A, true) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 0u,
               "QEI PMD blocks bypassed input changes");
        dspic33_write_word(cpu, pmd_addresses[channel], 0u);
        expect(state,
               dspic33_device_advance(cpu, 1u) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 0u &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 2u)) & 1u) != 0u,
               "QEI PMD resume synchronizes bypassed input without an edge");
        expect(state,
               input(cpu, channel, DSPIC33_QEI_PHASE_B, true) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 1u,
               "QEI bypassed input counts the next physical edge");

        reset_qei(cpu);
        set_open_comparison_window(cpu, base);
        dspic33_write_word(cpu, (uint16_t)(base + 2u), QEI_FILTER_ENABLE);
        dspic33_write_word(cpu, base, QEI_ENABLE);
        dspic33_write_word(cpu, pmd_addresses[channel], pmd_masks[channel]);
        expect(state,
               dspic33_device_advance(cpu, 1u) &&
                   input(cpu, channel, DSPIC33_QEI_PHASE_A, true),
               "QEI PMD blocks filtered input changes");
        dspic33_write_word(cpu, pmd_addresses[channel], 0u);
        expect(state,
               dspic33_device_advance(cpu, 1u) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 0u,
               "QEI PMD resume does not bypass the input filter");
        expect(state,
               dspic33_device_advance(cpu, 2u) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 0u &&
                   dspic33_device_advance(cpu, 1u) &&
                   read_counter(cpu, (uint16_t)(base + 6u)) == 1u,
               "QEI filtered input resumes after three stable samples");

        reset_qei(cpu);
        dspic33_write_word(cpu, pmd_addresses[channel], pmd_masks[channel]);
        dspic33_write_word(cpu, pmd_addresses[channel], 0u);
        expect(state,
               dspic33_device_advance(cpu, 1u) && !cpu->io.qei.pmd_disabled[channel],
               "QEI PMD generation ignores stale transitions");

        {
            uint64_t device_cycles = cpu->device_cycles;
            size_t queued = cpu->events.count;
            cpu->device_cycles = UINT64_MAX;
            expect(state,
                   !dspic33_qei_input(cpu, channel, DSPIC33_QEI_PHASE_A, true, 1u) &&
                       cpu->events.count == queued,
                   "QEI input scheduling failure queues no partial event");
            cpu->device_cycles = device_cycles;
        }

        {
            uint64_t device_cycles = cpu->device_cycles;
            uint16_t generation = cpu->io.qei.pmd_generation[channel];
            bool disabled = cpu->io.qei.pmd_disabled[channel];
            size_t queued = cpu->events.count;
            uint16_t pmd = dspic33_read_word(cpu, pmd_addresses[channel]);
            cpu->device_cycles = UINT64_MAX;
            dspic33_write_word(cpu, pmd_addresses[channel],
                               (uint16_t)(pmd | pmd_masks[channel]));
            expect(state,
                   dspic33_read_word(cpu, pmd_addresses[channel]) == pmd &&
                       cpu->io.qei.pmd_generation[channel] ==
                           (uint16_t)(generation + 2u) &&
                       cpu->io.qei.pmd_disabled[channel] == disabled &&
                       cpu->events.count == queued &&
                       cpu->stop_reason == DSPIC33_EVENT_QUEUE_ERROR,
                   "QEI PMD scheduling failure rolls back and invalidates the event");
            cpu->device_cycles = device_cycles;
            cpu->stop_reason = DSPIC33_RUNNING;
        }
    }
}

static void copy_cases(QeiConformance* state, Dspic33* cpu) {
    Dspic33 copy;
    bool initialized = dspic33_initialize(&copy);
    expect(state, initialized, "initialize QEI copy destination");
    if (!initialized) {
        return;
    }
    reset_qei(cpu);
    dspic33_reset(&copy, 0u);
    expect(state,
           dspic33_qei_input(cpu, 0u, DSPIC33_QEI_PHASE_A, true, 2u) &&
               dspic33_qei_input(cpu, 1u, DSPIC33_QEI_HOME, true, 3u) &&
               dspic33_copy(&copy, cpu),
           "copy QEI state with pending input events");
    expect(state,
           dspic33_device_advance(&copy, 3u) && (copy.qei_inputs[0] & 1u) != 0u &&
               (copy.qei_inputs[1] & 8u) != 0u && cpu->qei_inputs[0] == 0u &&
               cpu->qei_inputs[1] == 0u && cpu->events.count == 2u,
           "QEI copied events execute independently");

    reset_qei(cpu);
    set_open_comparison_window(cpu, bases[0]);
    dspic33_write_word(cpu, (uint16_t)(bases[0] + 2u),
                       (uint16_t)(QEI_FILTER_ENABLE | (1u << 11u)));
    dspic33_write_word(cpu, bases[0],
                       QEI_ENABLE | (2u << QEI_DIVIDER_SHIFT) | QEI_MODE_TIMER);
    input(cpu, 0u, DSPIC33_QEI_PHASE_A, true);
    expect(state,
           dspic33_device_advance(cpu, 2u) && cpu->io.qei.counter_fraction[0] == 2u &&
               cpu->io.qei.filter_stability[0][0] == 1u && dspic33_copy(&copy, cpu),
           "copy partial QEI counter and filter phases");
    expect(state,
           dspic33_device_advance(cpu, 2u) && dspic33_device_advance(&copy, 2u) &&
               read_counter(cpu, (uint16_t)(bases[0] + 6u)) == 1u &&
               read_counter(&copy, (uint16_t)(bases[0] + 6u)) == 1u &&
               cpu->io.qei.filter_stability[0][0] == 2u &&
               copy.io.qei.filter_stability[0][0] == 2u,
           "copied QEI phases resume identically");
    expect(state,
           input(cpu, 0u, DSPIC33_QEI_PHASE_A, false) &&
               dspic33_device_advance(cpu, 2u) && dspic33_device_advance(&copy, 2u) &&
               (cpu->io.qei.filtered_inputs[0] & 1u) == 0u &&
               (copy.io.qei.filtered_inputs[0] & 1u) != 0u,
           "copied QEI physical and filter state diverge independently");

    reset_qei(cpu);
    dspic33_write_word(cpu, pmd_addresses[0], pmd_masks[0]);
    expect(state, dspic33_copy(&copy, cpu), "copy pending QEI PMD transition");
    expect(state,
           dspic33_device_advance(cpu, 1u) && dspic33_device_advance(&copy, 1u) &&
               cpu->io.qei.pmd_disabled[0] && copy.io.qei.pmd_disabled[0],
           "copied QEI PMD transition completes independently");
    dspic33_destroy(&copy);
}

int main(void) {
    Dspic33 cpu;
    QeiConformance state = {0u, 0u, 0u};
    bool initialized = dspic33_initialize(&cpu);
    expect(&state, initialized, "initialize QEI processor");
    if (initialized) {
        register_cases(&state, &cpu);
        quadrature_cases(&state, &cpu);
        quadrature_transition_cases(&state, &cpu);
        divider_polarity_output_cases(&state, &cpu);
        external_mode_cases(&state, &cpu);
        timer_filter_power_cases(&state, &cpu);
        interrupt_compare_index_cases(&state, &cpu);
        compare_refresh_cases(&state, &cpu);
        power_lifecycle_cases(&state, &cpu);
        pps_cases(&state, &cpu);
        large_timer_advance_cases(&state, &cpu);
        pmd_cases(&state, &cpu);
        copy_cases(&state, &cpu);
        expect(&state, state.cases == 528u, "QEI assertion accounting");
        dspic33_destroy(&cpu);
    }
    report_sfr_side_effect_coverage(
        "qei", qei_sfr_side_effect_coverage,
        SFR_SIDE_EFFECT_COVERAGE_COUNT(qei_sfr_side_effect_coverage),
        state.failed == 0u);
    printf("[qei-summary] cases=%" PRIu32 " passed=%" PRIu32 " failed=%" PRIu32 "\n",
           state.cases, state.passed, state.failed);
    return state.failed == 0u ? 0 : 1;
}
